package org.worldcraft.dominioncraft.town;

/**
 * Перечень прав (permissions), применимых в рамках города.
 * <p>Каждое право может быть:
 * <ul>
 *   <li>привязано к {@link TownRank} (глобально для всех чанков);</li>
 *   <li>задано персонально игроку на конкретном чанке через override
 *       в {@link TownChunk#setPlayerPerm(java.util.UUID, TownPermission, boolean)}.</li>
 * </ul>
 */
public enum TownPermission {

    /* ---------- базовые действия ---------- */
    /** Ставить блоки. */
    BUILD,

    /** Ломать блоки. */
    BREAK,

    /** Открывать контейнеры — сундуки, бочки, шалкеры, печи, вагонетки-сундуки и т.п. */
    CONTAINER,

    /** Взаимодействовать с дверями, кнопками, рычагами, лодками, вагонетками без инвентаря и др. */
    INTERACT,

    /** Собирать/сажать урожай, использовать мотыгу, топтать грядки, помещать воду/лаву для ферм. */
    FARM,

    /** Убивать/разводить/кормить животных, торговать с жителями, ломать рамки/картины. */
    ANIMAL,

    /* ---------- управление людьми и клеймами ---------- */
    /** Приглашать игроков в город. */
    INVITE,

    /** Выгонять игроков из города. */
    KICK,

    /** Claim / unclaim чанков. */
    MANAGE_CLAIMS,

    /** Назначать ранги другим участникам. */
    SET_RANK,

    TOWN_OPEN, //Открытие закрытие города

    /** Выдавать индивидуальные права на текущем чанке. */
    CHUNK_PERM,

    /* ---------- PvP ---------- */
    /** Включать или выключать PvP для всего города. */
    MANAGE_PVP,

    /** Менять PvP-флаг исключительно у текущего чанка. */
    CHUNK_PVP,

    /* ---------- административное ---------- */
    /** Полностью удалить город. */
    DELETE,

    CHUNK_EXPLOSION,

    EXPLOSION // право на взрывы
}
